output/posts/cookie/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>cookie | My Nikola Site</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://example.com/posts/cookie/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Nikola Tesla">
<link rel="prev" href="../learn_music/" title="Learn Music" type="text/html">
<link rel="next" href="../just_doing/" title="Just Do" type="text/html">
<meta property="og:site_name" content="My Nikola Site">
<meta property="og:title" content="cookie">
<meta property="og:url" content="https://example.com/posts/cookie/">
<meta property="og:description" content="属性











属性
说明




name
cookie的名字



value
值，如果为EXPIRED，则将cookie置为失效



path
对应的path



Expires
失效时间。按一定格式。如Tue, 26-Dec-2017 12:08:25 GMT;



Secure
是否是保密



HttpOnly
是否是HttpOnly







Http set
">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-12-27T20:09:07+08:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">My Nikola Site</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">cookie</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../../authors/nikola-tesla/">Nikola Tesla</a>
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-12-27T20:09:07+08:00" itemprop="datePublished" title="2017-12-27 20:09">2017-12-27 20:09</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org7c6b51a" class="outline-2">
<h2 id="org7c6b51a">属性</h2>
<div class="outline-text-2" id="text-org7c6b51a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">属性</th>
<th scope="col" class="org-left">说明</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">cookie的名字</td>
</tr>
<tr>
<td class="org-left">value</td>
<td class="org-left">值，如果为EXPIRED，则将cookie置为失效</td>
</tr>
<tr>
<td class="org-left">path</td>
<td class="org-left">对应的path</td>
</tr>
<tr>
<td class="org-left">Expires</td>
<td class="org-left">失效时间。按一定格式。如Tue, 26-Dec-2017 12:08:25 GMT;</td>
</tr>
<tr>
<td class="org-left">Secure</td>
<td class="org-left">是否是保密</td>
</tr>
<tr>
<td class="org-left">HttpOnly</td>
<td class="org-left">是否是HttpOnly</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1277134" class="outline-2">
<h2 id="org1277134">Http set</h2>
<div class="outline-text-2" id="text-org1277134">
</div>
<div id="outline-container-orgbdefbb9" class="outline-3">
<h3 id="orgbdefbb9">设置一个有有效期的cookie</h3>
<div class="outline-text-3" id="text-orgbdefbb9">
<p>
<code>Set-Cookie: safecode=EXPIRED; Path=/; Expires=Tue, 26-Dec-2017 12:08:25 GMT; Secure; HttpOnly</code>
</p>
</div>
</div>
<div id="outline-container-orge87496c" class="outline-3">
<h3 id="orge87496c">设置一个永久有效的cookie</h3>
<div class="outline-text-3" id="text-orge87496c">
<p>
<code>Set-Cookie: ticket=3a9fe9f38e7c59f043508be2b878c5d28b430832; Path=/; Secure; HttpOnly</code>
</p>
</div>
</div>
<div id="outline-container-orgfb4313b" class="outline-3">
<h3 id="orgfb4313b">将一个Cookie置为过期，注意时间是之前的时间</h3>
<div class="outline-text-3" id="text-orgfb4313b">
<p>
<code>Set-Cookie: aster_ticket=EXPIRED; Path=/; Expires=Tue, 26-Dec-2017 12:08:25 GMT; Secure; HttpOnly</code>
</p>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../learn_music/" rel="prev" title="Learn Music">Previous post</a>
            </li>
            <li class="next">
                <a href="../just_doing/" rel="next" title="Just Do">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:n.tesla@example.com">Nikola Tesla</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
